[
  {
    "ScholarID": "125A",
    "FeedbackText": "Thank you for competing in Couch camp 2, worlds boogaloo!! We have marked your essay and would like to provide you with feedback, and so to start off, your essay showed me a lot of points you had, about your point of a sequel should be written if the novel is successful. (Remember that “succession” and “successful” are different words!) your points were great, however try to link back to the motion and try to answer the motion of whether it should or should not be, and use examples to strengthen your points. Thank you so much for writing an essay!"
  },
  {
    "ScholarID": "121B",
    "FeedbackText": "Thank you for participating in Couch camp!! Sorry for our error of being late to send in your feedback, we have read your essay throughout and have given you your score. For your feedback, your essay was easy to understand and follow through, especially with your stance that you want to edit our world of COVID. However, although being a fair stance, you also need to remind yourself that that is just your stance, and you need to also use references from the curriculum to secure your point. Give more examples and proof to back up your points( also try to get more points in your essay) and you’ll achieve greater writing skills! Thank you!"
  },
  {
    "ScholarID": "110A",
    "FeedbackText": "Hello! Thank you for submitting your essay to the Couch camp essay writing event!! Your essay was adequately written, however you need to use examples to prove the points you bring up in your essay, so that you can successfully prove the motion. Your linking back to the motion at the very end is also really crucial, so try to develop that as well. Thank you so much!!"
  },
  {
    "ScholarID": "122C",
    "FeedbackText": "Hello! Thank you for submitting your essay for Couch camp 2, worlds boogaloo. It was a pleasure to read your essay, and I believe that you did a good job finding facts about how fast fashion harms the environment. However, when writing your essay, you need to remember to tie it back to the opening which you wrote at the beginning, and the motion. You talked about ethics in your opening, and so you should talk more with examples about ethics and the feasibility of eradicating fast fashion, take the motion from many perspectives and provide examples which support your stance. This way you should have a strong essay argument. Thank you so much!!"
  },
  {
    "ScholarID": "109C",
    "FeedbackText": "Good use of examples on both sides of the topic, the essay was original and informative. Although the overall clarity in this essay was missing, to improve back up your points with more evidence next time, also try to make it a bit more engaging.  "
  },
  {
    "ScholarID": "328Y",
    "FeedbackText": "Your essay was structured well, and was creative as you used anecdotes to express the motion. Next time you could improve on providing more content for the reader, you could also make it more enganging by writing some how it would be if you would have rebooted your life. "
  },
  {
    "ScholarID": "326X",
    "FeedbackText": "Hey Momoe! I believe that your essay was great but could have been improved on some aspects. I acknowledge that there may have been a language barrier in portraying ideas for this essay, and I can say that you definitely put in some great effort trying to convey your opinions.   However, unfortunately, your essay did not accurately reflect upon the writing prompt. The writing prompt requested you to choose a specific piece of art or music from the WSC curriculum and to remake it within 100 years. For example, if I was the writer I would choose to remake the Edo Castle, which was in the WSC curriculum. I could then develop ideas and explain why. You may have misinterpreted this motion as you expressed your ideas about how derogatory language in pieces of music can harm people and how that should be changed. Because of this, I was unable to give you high marks on your content as you didn’t provoke thoughts regarding the motion. Still, in this topic you talked about the impact these pieces of art could have on the person effectively, but could have used some examples or statistics to back up this type of information if you were to support your own ideas through an opinion essay format.   Next, in terms of clarity, your ideas were understandable, but not very clear most likely due to the language barrier. I believe that you presented an amazing effort in presenting your ideas. To improve, you could simply improve on your grammar and be more straight to the point. However, the language barrier is completely relatable, so I tried to be more lenient in grading this area!  In terms of the style of your writing, an essay is absolutely fine! However, the WSC staff prefer styles that stand out more, such as poems, scripts, plays, and short stories! This is because they are normally more exciting and interesting than essays. However, because of your language barrier, I believe that sticking with an essay would probably be easier for you, as they would probably convey your ideas more clearly. I would recommend improving your essay writing skills for now, and getting more creative when you are able to deliver your points concisely.   Lastly, in terms of originality, I believe you were able to present your own personal opinion strongly as you were able to tackle the moral problems of derogatory language and how it was unethical. However, you could have stated why changing the freedom of offensive topics in music is important and how people are hurt by bad language due to excessive freedom singers and songwriters have.   Thank you for reading through this massive amount of text! Have a nice day and contact me at @edwin_cheah#6927 on Discord for further inquiries! "
  },
  {
    "ScholarID": "123B",
    "FeedbackText": "The essay was engaging and clear to understand. It was also informative, however it felt like the introduction was stretched a lot, and there was not a main body. Another thing to improve upon is when you are writing a formal essay, it is good to look at both sides and then form a judgement, as that helps build your essay.    "
  },
  {
    "ScholarID": "123C",
    "FeedbackText": "I like that you looked at both sides of the motion when you considred about rejecting or accepting the request. Next time don't say your opinion in the introduction, thats usually done in the conclusion. The essay was also enagnging. Lastly you could have expanded on your substantive more.  "
  },
  {
    "ScholarID": "121C",
    "FeedbackText": "There were a lot of facts packed into this essay, which made it informative as well. The essay lacked a proper structure, to improve you could have divided it into 3 paragraphs, with introduction, body and then conclusion. The essay was clear, next you could expand more on your points. "
  },
  {
    "ScholarID": "120A",
    "FeedbackText": " Hey Aadvik! In summary, your essay was able to identify the problem and you presented a great effort! However, you misunderstood the motion slightly which affected your content score. First of all, the motion asked for a solution where you are a scientist and will edit the planet itself via methods such as an aerosol injection. However, you did not edit the planet itself but presented a solution that would change what was on the planet and the pollution in the air. You presented a non-biodegradable plastic removing, reforestation, and filter machine. You did not prove that this machine could work and how this machine could work and solve the problems you mention. This made it hard for me to understand your ideas, making your ideas unclear. You were able to mention the problems you wanted to solve quite clearly but were unable to specifically mention how your machine could contribute to solving these problems. Still, you did not prove your points with scientific information and made some slippery slope fallacies, stating how a filter would reduce global warming, and how that would reduce the amount of natural disasters. You needed to support that with evidence, and explain how your machine can contribute properly. To improve your score, you should have given me at least a general idea of your machine and how it would work. You also needed to explain your conclusion and explain why your machine can help specifically. You wrote your work in the form of an essay, which is perfectly fine. However, the essay markers prefer a more creative style such as a script, play, short story, or other. This would make it more creative and stand out. Lastly, in terms of originality, your opinion was not very strong, as you did not go into detail and elaborate on your ideas of the machine. Thank you for reading through this long-winded feedback text and contact me at @edwin_cheah#6927 on Discord for further inquiries. "
  },
  {
    "ScholarID": "301X",
    "FeedbackText": "You picked an interesting topic to write about considering the mythos and legends surrounding King Arthur. I see how you tried to adhere to the prompt of describing what their last day was like but there were some instances where this deviated. You ended up mixing what their reign was like with what their last day was like which are two seperate things. You also fell into the common phenomenom where authors \"tell\" their stories instead of \"showing them\" which makes it more difficult to be invested or deliver much emotional impact. Maybe instead of taking in as many events as possible and trying to explain them all just a little bit with your limited word count, you could have tried to take 1 event that you felt had the most significance in the tale of King Arthur and structured your essay on how that moment defined his rule."
  },
  {
    "ScholarID": "102C",
    "FeedbackText": "I was impressed by the writing structure; it had good intro and flow and provided examples for each argument. However, the argument has not completely convinced me why the cons’ side of fast fashion and its detrimental long term impacts of it can be ignored. It would be nice to see a stronger justification on your essay next time by arguing and explaining why they do not matter more than the benefits next time!"
  },
  {
    "ScholarID": "102A",
    "FeedbackText": "Personally the paper sounded like a speech. It utlizes fancy rhetoric and appeal to convince someone in a political manner to not do such a thing (which can be convincing), however content-wise it would be nicer if the evidence you have shown are given more emphasis on the implications, especially the TNT example to convince readers more on your stance. Overall, it was easy to follow and pleasant to read your essay. "
  },
  {
    "ScholarID": "116A",
    "FeedbackText": "Your essay provides a pleasant and easy to follow analogy on why CEOs shouldn’t appoint successors. However, more examples and perspectives can be used to strengthen your argument (in curriculum, they covered succession in different cultures and many more) and would be interested to look for more wsc-curriculum examples you have studied! Overall, with more elaboration and demonstrations from examples, there seem to be a lot of potential for this essay. "
  },
  {
    "ScholarID": "117B",
    "FeedbackText": "your essay on editing the planet is quite ambitious! there were a lot of things that were pointed out, nevertheless I was looking forward to listen about your story of why you picked all these choices, and why not others; I look forward to hearing you present and convince me that the things you’d like to change is important to be changed. Regardless, the essay you’ve written had excellent structure and it was pleasant to navigate through it!"
  },
  {
    "ScholarID": "309Y",
    "FeedbackText": "Hey Manasha! Awesome and outstanding essay! You were able to draw connections from the motion and transfer very interesting and relevant ideas onto the paper. You were also able to bring up examples of people defined as geniuses and prove that such people would be able to contribute more to society due to combined ideas and collaboration, and you strongly point out your view of how humanity is nearing an “immortal stature”. However, there were a few minor drawbacks in your content and you could have improved your essays in other aspects as well. In terms of clarity, you were able to clearly deliver your points with minimal grammatical errors and had seamless transitions. You were able to maintain a strong perspective and persuasive tone throughout, maintaining high marks in clarity, In terms of content, you provided examples of how cryogenics could be of use to preserve geniuses. However, you could have defined geniuses to give more context based on an existing standard such as IQ to specify what you interpret the motion as. Also, you mentioned how strong minds from different generations could be brought together to form more efficient solutions. You lacked a bit of proof on this point, as this is not always the case. For example, geniuses often tend to be more centered towards their own ideas, and may often disagree with others. This could easily cause issues in collaboration. You had no proof against this argument, making this particular point weaker. Also, you mention how cryogenics can save lives as they can prolong the time they live. However, this is not true, as cryopreservation merely preserves cells and does not cure diseases itself. It also only prolongs one’s life. Even though one may live decades more, in this time, they will be inactive. Also, this does not relate to the motion, and starts to drift the essay away from the motion (except when you briefly mentioned how more geniuses can contribute more). This further continues when you talk about cryogenics in space travel. Instead of doing this, you should have related this directly to geniuses and how they could be involved with future activity. In terms of style, an essay is absolutely fine, but it is preferable to write in another form of writing such as a story or a play script. In terms of originality, your essay was quite strong and you were able to strongly present your ideas and allowed me to easily relate to your ideas. Your essay was also very engaging and memorable, using quotes and other thought-provoking pieces of text. For further enquiries, please contact me at @edwin_cheah#6927 on Discord. "
  },
  {
    "ScholarID": "304Y",
    "FeedbackText": "Good effort! I understand that there may have been a language barrier when creating this piece of writing. I believe that this was a great try on your behalf. However, there are a number of ways to improve your essay, especially by improving your content and clarity. First of all, in terms of content, you could have improved on your factual information and proved your points. Also, you could have limited the use of hypothetical scenarios you used as your scenario was not based on. This is because the sequence of events mentioned was not proven by facts at all and is very unlikely to happen. Also, you did not define “genius” specifically against a measurable standard such as IQ. More importantly, a lot of your factual information was inaccurate, such as Hitler being the cause of World War 1 or the fact that cryogenics uses high temperatures. Your priorities are also placed illogically, as you place entertainment before the fate of mankind. To improve the essay, you should make your essay more factually accurate and logical. Next, your essay was unclear, as your ideas were not clearly organized and there were bad transitions between sentences and paragraphs in the essay. Also, your grammar was not very good. However, I have been more lenient with your marks as I acknowledge the existing language barrier. Next in terms of form, an essay is absolutely OK. However, other creative forms such as scripts, short stories and more are preferred. Still, I believe that you should focus on your content and clarity more than worry about the form. Lastly, I believe that you should try to keep a good balance between factual information and personal opinion. Even though you spoke what you personally thought, you still have to relate it back logically. For further inquiries, please contact me at @edwin_cheah#6927 on Discord!"
  },
  {
    "ScholarID": "114A",
    "FeedbackText": "You provided many pieces of evidence about the ozone layer, which helped you, partially, to argue your claim. However, you did not comprehensively approach on how effective the change would be, instead you argued that the current state of the earth would be simply reversed. Additionally, you could also improve on organization, specifically helping your reader know the beginning, middle, and end by adding a proper conclusion for your argumentative approach to the prompt."
  },
  {
    "ScholarID": "115B",
    "FeedbackText": "Your essay took a unique approach to the prompt, in which you creatively twisted the prompt -I loved it! I would suggest you provide more details as to the mistakes (evidence) for a more comprehensive approach. Overall, it was a really well written piece, especially since you clarified your meaning of \"mistake\" in the very beginning."
  },
  {
    "ScholarID": "302X",
    "FeedbackText": "Personally, I love your style Laetita and how you put it as a poem. Although you did follow the structure, some feedback from me is that the second part of the motion wasn't very clear in your piece. However, there were some lines that demonstrated this idea. Another aspect you need to work on is to include parts of the curriculum in your writing so it is relevant to the syllabus. Overall, you did a fantastic job and I look forward to your development as a writer :'>.  "
  },
  {
    "ScholarID": "303X",
    "FeedbackText": "Starting off with some positives, I think you did a wonderful job Pracket and I can tell you tried to use a variety of word choices and vocabulary. As well as including some aspects of the science curriculum. Some feedback from me is not using a lot of quotes. For example, you could rewrite the definition of cryogenics in your own words. Another thing is thoroughly checking and editing your work for typos etc. Overall, your piece was written in a very well manner and I look forward to your future compositions!"
  },
  {
    "ScholarID": "125B",
    "FeedbackText": "Great effort! I can tell that you have tried to write this despite the language barrier, and I have taken this into account when scoring your essay. First of all, in terms of clarity, your essay was not clear and did not have smooth transitions. It was hard to follow, and the grammar mistakes made the essay hard to read. Specifically, your punctuation is inaccuand the person you write in fluctuates. To improve, you should focus on your grammar, and connect your points but not suddenly changing the subtopic. However, do not be discouraged, as the language barrier makes it difficult to perfect clarity. In terms of content, you selected two types of scenarios and provided specific anecdotes about these mistakes. This was not the motion, as you were to mention one specific mistake and mention the reason you would change it inside. You then mention why you wanted to change these categories of mistakes, and how they can harm others. However, you did not go into much detail. Also, your first justification about why you wanted to change your mistake did not make sense, as you mention sharing the mistake as your reason which has no relation with going back in time. To improve, you need to write more logically and make sure your essay makes sense. In terms of the form, an essay is OK, but the preferred forms are creative ones, such as scripts, short stories, or others. However, you should focus on your content and clarity before focusing on your form. Lastly, regarding the essay’s opinion, you were unable to express your opinion with strong views. Please do not be discouraged by this, as this feedback aims for you to improve. As you may not be familiar with English, this performance was good enough! For further enquiries, please contact @edwin_cheah#6927."
  },
  {
    "ScholarID": "306X",
    "FeedbackText": "The piece was clear and concise with sound knowledge and well-researched explanations. To improve, a sense of creativity/originality should be created- possibility by adding more personal experience/anecdotes to make the content more engaging. "
  },
  {
    "ScholarID": "308Y",
    "FeedbackText": "This was a great attempt at answering the motion, and it was well-researched, showing sound knowledge of the curriculum. However, it lacked clarity and was quite hard to follow. To improve, you could work on structuring your essay to make it easier to follow (for the reader) and also incorporating more original elements to make it more engaging. "
  },
  {
    "ScholarID": "308Z",
    "FeedbackText": "The essay was well-researched and showed sound understanding of the topic matter, and the beginning was strong, capturing the reader's attention well. However, the essay slightly lacked originality and and a unique/personal writing style. This can be created by utilizing more personal language and examples instead of online relying on internet research."
  },
  {
    "ScholarID": "308X",
    "FeedbackText": "The piece was original and creative, with a clear sense of uniqueness to the style. To improve, you could incorporate more parts of the WSC curriculum to show your knowledge and understanding. Also, note that the word \"reign\" is usually used in the context of royalty (ie. king/queen rather than PM). Overall, well done!"
  },
  {
    "ScholarID": "310Y",
    "FeedbackText": "The essay was clear, concise, well-researched, and had a unique voice. There was a good balance of solid research and personal anecdotes. Overall a great, engaging piece; consider improving slightly more by incorporating some prebuttals in your piece! "
  },
  {
    "ScholarID": "311Z",
    "FeedbackText": "Hey Estelle, your essay was relatively clear, and was able to effectively argue against the motion. You were also able to bring out your opinion quite well. Now, I would like to suggest several improvements and point out the pros and cons of your essay in detail. In terms of clarity, your essay was relatively understandable, but had a few transitions that were not seamless and did not smoothly change the subtopic in the essay. Also, some parts did not make complete sense. For example, when you mentioned the “bad news” after the “revival” of a genius, you did not state a point, but followed up with a question, which made the point confusing and not make complete sense. You also changed topics abruptly between paragraphs, losing the flow of your writing. To improve, you should have double checked your essay to see if it makes sense and improve the flow of your writing by not abruptly changing the topic, but bringing up new topics which have close relation to the old one. In terms of content, you were able to bring forth your points, but had some factual errors and not much evidence. For example, you stated that cryogenics and cryonics were the same thing, but that is in fact not correct. Also, you had no scientific proof to prove that cryogenics was impossible except for a claim of one scientist. However, that is not sufficient at all, as a claim does not prove a fact. For example, looking at the device I am writing to you on right now, this device was once merely an idea which was seen as impossible at the time. To improve your essay, you needed to support your essay with scientific proof. You also created a hypothetical scenario where you talk about the opinions of others which you cannot actually relate to, as you claim that geniuses would not be comfortable with cryogenics. However, this may not be true and was again unproven. To improve your essay, you should improve the validity of your arguments by supporting it with scientific information instead of opinionated perspectives. In terms of the form of this piece of writing, an essay is absolutely fine, but a short story, script or other. You were able to express your opinion, but simply needed to find a good balance between fact and opinion in your essay. For further enquiries, contact me at @edwin_cheah#6927 on Discord!"
  },
  {
    "ScholarID": "327X",
    "FeedbackText": "Beautifully written piece of work! I Absolutely loved it! You managed to answer the prompts perfectly well and the paper is relatable to the readers which is very difficult to master. You had a great structure and format which indicates your creativity. It's very expressive and remarkable. It pulled the readers into their imaginations and made them want to read more which is a huge standard of a successful and good writer. Overall, Conclusion was the only lack. Please restrain from adding more information as it's the part to sum up everything that has been distributed; judges will look at it harshly which results in negative impact in your future write-ups. Finally, you did great; keep up your indescribable capability to write! "
  },
  {
    "ScholarID": "303Y",
    "FeedbackText": "Hey Prita. Your essay was able to express points that support the motion well. You were also able to be clear in supporting these points to an extent that it was easily understandable. However, there were still several points you could have improved on to make your essay better. First of all, in terms of clarity, you were able to write your points so that they were understandable. However, you did abruptly change your points and did not provide seamless transitions. Also, you were not straight to the point, and were often off-topic. An example of this is when you explained the story of Denis Diderot, which did not help you argue your side of the motion. To improve, you should be more concise and straight to the point. In terms of content, you had points, but did not back up your points with evidence except for some examples of topics that were not essential such as companies using the Diderot effect which could’ve instead been examples of people being affected by the Diderot effect as that was closely related to your main argument. You also used Wikipedia as a source, which is highly unrecommended due to its unreliability. Also, your definition (before the Wikipedia quote) was too broad, and was not specific and also copy pasted from Wikipedia without a proper citation. To improve, you should have proven your points with examples of existing consequences from the Diderot effect (of a specific person) so you can show the consequences that already exist. You should also use more reliable sources, and clarify your definitions. In terms of the form of the writing, an essay is absolutely OK, but is not preferred. Preferred formats include a script, short story, poem or other. Lastly, in terms of your opinion throughout the piece, it was not there as you normally just provided random facts and did not input your own opinion. For further enquiries, please contact me at @edwin_cheah#6927 on Discord for further enquiries!"
  },
  {
    "ScholarID": "111A",
    "FeedbackText": "Congratulations on your submission scholar! You have loads of content and you did a great referencing. I appreciate and salute your creativity on your format and structure by opening your points stanza by stanza. However, please restrain yourself from using “In my opinion” too much as essays are all opinion-based and facts are partly prominent to back up your opinions in writing essays. Everything else was very clear and understandable. You could've summarized the major points of your sequel example instead of just pasting the link of the sequel; whereas in the real wsc competition, it's compulsory for you to write a recap of your case/anecdote as it helps to  familiarize your readers with the example that you are raising. Again, I believe the room of improvement for you is to summarize what you’ve read and why you feel that way because writing essays are all about being expressive so don't be afraid to express more! Please continue to write like this; it is absolutely a present to humanity. May you do great and good luck on your future write-ups!"
  },
  {
    "ScholarID": "306Y",
    "FeedbackText": "What an outstanding piece of essay! This piece of work seemed too good to be true. I was amazed by your stunning writing skills. You perfectly captured the amount of creativity and artistry for the concept that your essay was going for. I am proud that you were able to address the issues with gender inequality and feminism in your essay. I am impressed with your strategy of asking questions and your technique of writing. Your excellent choice of words fit beautifully with your whole concept and chosen topic; it did a great job of describing you as a female leader. Overall, you wrote an extraordinary piece of work; keep up your infrequent ability to write. Good luck on your future write-ups!"
  },
  {
    "ScholarID": "114C",
    "FeedbackText": "Hello Skyler! I really liked your unique approach to the motion, a combination between both sides of the issue. I also really like how you summarized your essay clearly for the reader and made your point come through. However, you may want to try to structure your essay so that your stance on the topic stays consistent throughout the essay. Sometimes, because you came up with a solution for the motion that was between the two sides of the motion, it was hard to tell where you stood in the argument. Otherwise, I really like how you used real world examples and evidence from the curriculum! Keep up the great work! :)"
  },
  {
    "ScholarID": "304X",
    "FeedbackText": "Hello Chea! I thought your essay was really thought invoking and you have a lot of potential! However, I suggest trying to make sure that your sentences are not too long and that you do not connect all your sentences together into one huge sentence such as this one that I am writing right now. Writing long sentences such as these make it hard for readers to understand what you are trying to say. Otherwise, keep up the great work!"
  },
  {
    "ScholarID": "116B",
    "FeedbackText": "Hello Tiffany! I definitely think that you are on the right track to becoming an excellent writer! I love how your perspective on your essay was both unique and clear to the readers. However, I would suggest that you try giving more evidence for why you believe in your stance. Your essay had one really strong point but I feel that you definitely could have added more points to add to your essay and give it more life. Otherwise, keep up the awesome work! :)"
  },
  {
    "ScholarID": "304Z",
    "FeedbackText": "Hello! I think that your essay was unique and that with some improvements, your essay could become even better. The first thing I would suggest for your essay is to make your points clear by separating your points into separate paragraphs. This makes your essay easy to read and follow along with. The second thing I would suggest is to elaborate more about each point using examples from real life and from the WSC curriculum. With these tips, I think your writing could be greatly improved! Keep up the good work :)"
  },
  {
    "ScholarID": "301Y",
    "FeedbackText": "You chose an interesting medium through this script to write your essay. While it had some very interesting points I have two main comments. Firstly, while the prompt does talk about cryogenics, you could have differentiated your own essay by writing about the possibilities of freezing the geniuses as opposed to taking the stance everyone else took: Its not possible so let's not do it. Secondly, while I can see your attempts at injecting humor into the dialogue between the characters, the flow of the conversation seems forced as opposed to being more natural. If you had taken the time to work out the dialogue in a way that would reflect how people would probably discuss something like this, it could have set your essay apart."
  },
  {
    "ScholarID": "303Z",
    "FeedbackText": "A very interesting essay that was well done, Sahil. The overall structure of the piece is correct. However, I would advise you to use less informal language, because although the brackets give the reader more information, most of the time they are frowned upon. Another thing is grammar, most of the time it’ll be typos or a missing comma, but still make sure to check your work and edit it thoroughly before you submit your final work. As for clarity, the majority of this work was very fluent. Overall, you should try to improve on the points above. P.S: Don’t be ashamed of you who are, you are you and only you can change that :’) "
  },
  {
    "ScholarID": "324X",
    "FeedbackText": " Jennifer, I'm in love with this essay! The vocabulary and word choice are just amazing! You have a wide variety of sentences type. And the vocabulary is simply astounding. In your first paragraph, the introduction is straight to the point, but the way it's written is truly amazing! It will hook the reader in your writing easily! But there could be another sentence at the end to kind of conclude the paragrahph, instead of leaving it hanging. Something like : \"And here's why.\" could be nice. In the next 4 paragraphs, the grammar is perfect, the wording is again, amazing! Your vocabulary is super wide! I like how your explanation of cryogenic is very easy to understand. And I love how you gave an example. \"Just as a coin has two side\" is also a great phrase. But there's some part where the transitional word choice is a little bit limited, there could be some other word that make the flow smoother. For example, \"Therefore, by freezing...\", could be  \"Hence, by freezing...\". Your conclusion is a simple one, it will do it job! But again, the word choice is truly wonderful! Overall, I really love your essay, the vocabulary is amazing and the wording, too! There's a few typos, so next time when you check your essay, be more careful! This is truly an amazing essay, Jennifer."
  },
  {
    "ScholarID": "314Z",
    "FeedbackText": "I liked that you defined the difference between “reboot” and “restart” at the start as it clarifies it for the readers. Your piece flowed quite well, and I could understand the points you were trying to convey clearly. You had minimal errors (grammar, syntax, spelling), and the essay was quite structured. However, I would recommend that you try to use a wider and more vibrant range of vocabulary, to make it more personal and exciting. Since you were taking a personal approach to the prompt, it would help if you could elaborate further upon the reasons behind why you wanted to reboot your life, rather than just writing 2-3 sentences. Your ending felt rather abrupt and short, so I would suggest that you could lengthen that and end with a bang. Remember that in the World Scholar’s Cup itself, your essay will rank high if it leaves a lasting impression on the reader. Overall, you did quite well, though!"
  },
  {
    "ScholarID": "300Z",
    "FeedbackText": "Your essay had some interesting points, and I liked how you used examples to elaborate upon your points. You also succeeded to provide different approaches and points of view. Your piece flowed quite well, but you had multiple grammar, syntax, and spelling errors - please make sure that you recheck your essay for these things next time, as it could really bring your score down! Your explanations for why you chose each song was quite thorough, and you touched upon how these songs evoke different feelings in each listener. I liked the varied vocabulary that was present in your essay, which made it feel more vibrant. Your ending felt inconclusive, so I would suggest that you could improve that by restating your stance briefly and end with a powerful sentence. Remember that in the World Scholar’s Cup itself, your essay will rank high if it leaves a lasting impression on the reader. Overall, you did a decent job on this essay, but please remember to recheck it for errors!"
  },
  {
    "ScholarID": "301Z",
    "FeedbackText": "While you did write to the prompt, I don't think that you were really able to make the impact you were hoping for. Your reasoning regarding the bombing of Japan and WW2 ending are factually incorrect and anything you put there is just conjecture with no proof. If you had researched into the topic properly, you would know that several generals and high level government officials were against bombing Japan because the war was decidedly over long before they decided to bomb Japan. Your reasoning with the Chernobyl disaster is a logical fallacy, namely (Post Hoc Ergo Procter Hoc) after this, therefore because of this so the entire point doesn't stand. Your claims while having impact have no historical basis and make it hard for any reader to believe what you're saying."
  },
  {
    "ScholarID": "302Y",
    "FeedbackText": "Your first point on cryogenics being costly is very weak and defeats the point of talking about cryogenics in the first place. It's more akin to an investment and not just a waste of money like you say and beyond that, you just claimed that the government would never pay without giving evidence. Your second point has much more merit and value in terms of the topic because you were able to accurately showcase the problems associated with cryogenics and I believe that this is the side of your writing that you should focus completely on."
  },
  {
    "ScholarID": "317X",
    "FeedbackText": "Hello! I would suggest for your writing that you try and use transition words such as \"first\", \"next\", and \"finally\" to separate your points. I would also suggest that you separate your individual points into paragraphs and try to use more evidence to back up your claims. Also try to stay more on topic as you veered off track multiple times."
  },
  {
    "ScholarID": "324Y",
    "FeedbackText": "Your points are strong and the research is terrific. You separate paragraphs logically. But there's a big problem throughout your essay. You're missing a lot, and by a lot, I mean I can spot more than 3 in every paragraph. Some of the punctuations are extremely important ones, Justin. Without some of these, it's very confusing to read. I struggle to understand some of them. In some of the complex sentences, there are no commas to separate them at all! You should identify the extra information in some of the sentences and separate them using commas. In other sentences, you also didn't separate the clauses. The wording is a little bit weird and some information should be explained more. There are a few spelling mistakes where you wrote buy instead of by or IKEA in non - capital. I'd advise you to check your essay a few times for missing punctuation and spelling errors! :D "
  },
  {
    "ScholarID": "123A",
    "FeedbackText": "Greetings! Your collaborative writing piece for Couch Camp 2.0 needs a bit of improvement. You need to focus on the prompt of the writing more closely, because you kept telling us that you wanted to change \"the environment\", but the prompt wants you to be more specific: \"HOW are you going to change the environment and why?\". Also, your Dodo bird example and the statistics which you brought up are not related to your points, so be more careful with your evidence.  "
  },
  {
    "ScholarID": "305X",
    "FeedbackText": "Greetings! Your collaborative writing piece for Couch Camp 2.0 had an interesting theme about Cyrogenic methods, but the way in which you delivered your argument was not great. For starters, you spent far too many words trying to define the entire process and science of Cyrogenics and even geniuses, which wasn't necessary and wasted lots of words which you could've used to make convincing arguments about WHY this technology would be incredibly helpful to society in the future. Focus on the argument rather than the actual technicalities of your stance next time."
  },
  {
    "ScholarID": "109B",
    "FeedbackText": "Greetings! Your collaborative writing piece for Couch Camp 2.0 was a bit confusing and didn't quite answer the prompt. The science prompt clearly says \"you have created A WAY to edit our planet\", but you brought up almost 4 different ways to edit the planet. In addition, each of these 4 ways, while interesting to read about, did not link back to the central argument of your essay. Finally, the formatting of the essay seemed a lot like a debate script, which it should not be, so try to avoid this in future attempts."
  },
  {
    "ScholarID": "317Y",
    "FeedbackText": "Greetings! Your essay for Couch Camp 2.0 needed a bit of work on it. For starters, it was very short (267 words), and as a result you could not give an argument at all. While your story was very interesting (I hope you're still enjoying that skateboard), you did not link it back very well to the Special Area prompt. You should have used more examples from the curriculum this year as well as spent more time writing more points about the motion. Please also don't spend time at the beginning of the essay telling us what motion you chose, we know what motion you chose already.  "
  },
  {
    "ScholarID": "302Z",
    "FeedbackText": "While you did follow the prompt to an extent, it wasn't what should be expected. Firstly, you gave no indication whatsoever about who you were referring to in the essay which made it hard for me to engage as a reader. The essay was all over the place trying to characterize every single thing that happened in the most basic sense possible so it lacked details. I would suggest reevaluating what you want to write about first and having a clear goal in mind when writing essays to make it easier for both yourself and any readeres."
  },
  {
    "ScholarID": "328X",
    "FeedbackText": "Greetings! Your essay for Couch Camp 2.0 was not too focused on the motion. The prompt for Special Area clearly says \"which mistake from this year's curriculum\", and Covid-19 online studying is not a mistake on the WSC Special Area Curriculum for 2020. On top of that, you began talking about THREE different mistakes related to online learning and Covid, so again this does not relate to the prompt which asks for \"one mistake\". In addition, your entire essay is based off of the assumption that Covid-19 online learning is a mistake, but this is not true. Please pay more attention to the prompt next time in WSC writing."
  },
  {
    "ScholarID": "110B",
    "FeedbackText": "Your essay developed a point which raised potential questions as to how we should and shouldnt control our environment. Next time, try to work on your grammar and also try to use correct words when writing your essay. Using references from the curriculum helps as well! Thank you!"
  },
  {
    "ScholarID": "108C",
    "FeedbackText": "Greetings! Your writing piece for Couch Camp 2.0 was not that persuasive for the motion. You gave three very quick points regarding the motion and your stance, but these points were not very good and you didn't use lots of evidence to back them up. Furthermore, the essay as a whole was very short (184 words or so), so you couldn't develop your points in a proper paragraph. Please try to focus on expanding your arguments and using more evidence related to the motion. "
  },
  {
    "ScholarID": "101A",
    "FeedbackText": "Hey! I loved the way you themed this! I love the Maze Runner too, I have all books :) I suggest you correlate more parts of the curriculum into this (though the motion already inherently discusses it) I totally got all those really cool rhetoric and comparisons you made and how much flavor it adds to the paper. One more thing, I suggest you declutter and not use wordy sentences. Might just be me, but the amount of sentences in one paragraph really made it hard for me to read properly. Nonetheless, great job!"
  },
  {
    "ScholarID": "104A",
    "FeedbackText": "Greetings! Your essay for Couch Camp 2.0 is certainly an interesting one! I liked your idea of Christopher Columbus' voyage to America as a mistake you would like to correct. You certainly justified why Christopher Columbus' mistake was one worth fixing, and the language you used was certainly very descriptive. However, you should have spent more time justifying why this mistake is worth fixing and maybe even how you could fix it. Bringing in more mistakes from the curriculum would be ideal as well. Good job overall though! "
  },
  {
    "ScholarID": "105A",
    "FeedbackText": "Greetings! Your essay for Couch Camp 2.0 had some potential in it. However, you forgot to respond to the motion about \"what mistake would you correct?\",  instead you spent a fair portion of your essay telling us why you WOULDN'T fix one historical mistake. Focus on the motion more clearly and stick to your stance (the environmental mistake paragraph was interesting, but you hardly drew it out enough to be a convincing argument). Overall however good potential for the essay as a whole!"
  },
  {
    "ScholarID": "105B",
    "FeedbackText": "Greetings! Your essay for Couch Camp 2.0 was written in a very interesting perspective! I quite liked how you literally explored the motion as if you were the person receiving the offer, but unfortunately you may have gotten a tad carried away with the \"story\" bit of the essay rather than the actual \"persuasion\" part. It became more of a hypothetical and rhetorical ramble towards the end of the essay, so please maintain focus towards the motion more carefully and bring up more substantive points next time. Your style is certainly a massive plus though! "
  },
  {
    "ScholarID": "101C",
    "FeedbackText": "Hey! I really did love this essay and how straight to the point it was. I would suggest using more rhetoric in your essays, using bigger vocabulary and using more curriculum references because it'd help you a lot in your score! Thank you, good job!"
  },
  {
    "ScholarID": "106C",
    "FeedbackText": "Greetings! Your essay was actually a very interesting read for me to mark! Your argument about recreation versus creation was certainly a logical and interesting one. However, your structure was a bit confusing initially, but towards the end it certainly became more clear what your stance was (putting this at the beginning would've been better in the next essay). Overall however your style is fine but work on clarity and evidence for the next WSC writing you take part in! "
  },
  {
    "ScholarID": "102B",
    "FeedbackText": "Hey! Loved how this was written! I do suggest having a more varied sentence length, and using bigger words. I also don't suggest using entirely-capitalized words like BAM in professional essays. Thank you, good job!"
  },
  {
    "ScholarID": "324Z",
    "FeedbackText": "This is an amazing essay, Cindy! Your choice of word and vocabulary is out of this world. I feel like this is one of the books I would read in a library. The way you describe the character's feelings and thoughts are just amazing! But I would like to see more of this kingdom, I would like to see what the kingdom is like during the character's reign. There's some part where the flow isn't smooth/ the wording is a little bit weird. So some transitional phrases/words will make the flow more smoothly. Overall, this is one amazing essay!"
  },
  {
    "ScholarID": "125C",
    "FeedbackText": "Please try to use correct grammar when writing your essay! also, when you are writing an essay, use perspectives which are not just your own, but from the curriculum and use rescources online so that your essay can have depth. This will lengthen your essay by a mile."
  },
  {
    "ScholarID": "104C",
    "FeedbackText": "Reasonably good language was used in the essay, and you told a good story. Next time I would focus on improving the structure of your essay and clearly defining your points."
  },
  {
    "ScholarID": "104B",
    "FeedbackText": "Great use of your prior knowledge of the curriculum, next time you should focus more on your grammar and phrasing to better communicate your ideas."
  },
  {
    "ScholarID": "325X",
    "FeedbackText": "Hi Sherman, I just want to say this essay is really good. Your choice of word are amazing. Though, I would like to hear you evaluatue and explain the issues further more. Maybe listing and discussing the pros and cons could be a nice idea also. The way you use \"declare\" at the end is also very interesting! :D"
  },
  {
    "ScholarID": "108B",
    "FeedbackText": "Next time, you should aim to be more formal with your writing this shouldn't be like a speech. You should also expand on your points more."
  },
  {
    "ScholarID": "108A",
    "FeedbackText": "You need to more in-depth, and make complex arguments."
  },
  {
    "ScholarID": "313Z",
    "FeedbackText": "The essay was intriguing and thought-provoking. The storytelling is really interesting. However, the arguments were not really following the prompt. The motion says \"to preserve the geniuses of every generation\" but the essay argues about the angels taking the people for their bodies. Although this might be a different way to define the word genius, many of the readers might still be confused because of the common defintion of the word. Moreover, cryogenics, which is one of the keywords of the motion, is not defined clearly in the essay, leaving some readers confused. And also, the knowledge from the curriculum was not used effectively."
  },
  {
    "ScholarID": "315Z",
    "FeedbackText": "The essay was generally okay and easy to understand. First, the essay was well-organised and I really like the fact that you added some solutions for consumers to resist the Diderot Effect represented by commercials. The grammar and spelling were a bit off and although I can still follow what you are discussing with those errors, they should still be minimised in future essays. Second, the content was a bit far from the original prompt. You talked about the effects of Diderot Effect in life in general, not in commercials specifically. Your definition should be shortened and should include all the keywords of the motion in one paragraph only. Knowledge from the curriculum was not really fully used. Third, your style of writing was not too interesting even though I know that you are doing academic writing. Elements like emotions or questions should be utilised to keep the readers' attention. Also, when you do academic writing, it is best not to use spoken language. This style affects your originality too so try to write with a more interesting and persuasive voice or a creative approach with telling stories or writing poems to give a unique perspective on the prompt."
  },
  {
    "ScholarID": "317Z",
    "FeedbackText": "When you get straight to the point, you do not need to say “let’s get to to thy point why”. Your essay was very general. I was not able to get to know you from your essay. You want to eat healthy, exercise more, get more sleep, etc. and that is what everyone wants to do. WSC wants to see more interesting essays that catch their eyes. Maybe instead of telling us like an essay, you could have tried writing it like a memoir of your life. Tell stories from your life as to why you want to reboot it. The conclusion felt very last minute and lacked the excitement I got at the beginning of the essay. The conclusion contradicted your main point at little. I know that English may not be your first language, but try to clean up your mistakes in grammar a little more. It gets distracting a little when the grammar and punctuation is messed up a little and this can actually hurt your score. I suggest practicing using things like Grammarly to help with that."
  },
  {
    "ScholarID": "315X",
    "FeedbackText": "The essay was written fairly okay. It was easy to follow and the grammar, syntax and spelling were not too distracting although I highly suggest that they be minimised as much as possible. The introduction of the essay was a bit long and should be split in two, one being the real introduction and one being the definition. The content of your essay was presented well. However, the prompt only asks you for one case only and so it is better that you choose one case and really go in depth about it. One other way that you can rewrite your essay is that you put all the similarities of the cases and analyse them, and then go deep into each case. It will make the essay more logical. I also suggest you to use more vocabulary that can pull the readers in and engage them in your essay with questions and sentences of emotions. You can try using a more intriguing and persuasive voice when writing to make the essay more memorable for the readers. You can also try to tackle the prompt in a different way with a different interpretation or a different kind of writing such as telling stories or writing poems."
  },
  {
    "ScholarID": "314Y",
    "FeedbackText": "The writing was fairly good and some points were really thought-provoking. Grammar errors appeared really little but still needs to be minimised as much as possible. The introduction can be longer and the definition should be separated from the introduction. Knowledge from the curriculum wasn't used effectively and so in further WSC essays, you should try to use more of that. The point about geniuses conflicting with each other didn't really make sense because there was no efficient reasoning on that. The style and originality can use some improvement with a variety of vocabulary and expressions, a more interesting voice and a creative approach through stories or poems."
  },
  {
    "ScholarID": "313Y",
    "FeedbackText": "I really like your writing. The way you presented your ideas was really unique and the writing was really easy to follow and intriguing. Your style really dragged me into reading the essay. The experience you described was really relatable and so I feel included when reading the essay. The last part was something I did not see coming but really understandable. One drawback, though, is that you didn't use efficient knowledge from the curriculum. Nevertheless, this will a writing I will tell someone else about. Great job!"
  },
  {
    "ScholarID": "107A",
    "FeedbackText": "The sentence structure in the first paragraph could use some work. Some of it is very redundant in the same sentence, especially words like ‘water’. I like the use of facts and figures to emphasize your point. Please further research your arguments to maximize the effectiveness of your facts. English may not be your first language, but please take note of things like punctuation and capitalization. Nice grammar mechanics help you have a memorable essay and get a better score. I suggest practicing other styles of writing, such as poetry, and using things like idioms and hyperboles. This helps your essay stand out more."
  },
  {
    "ScholarID": "328Z",
    "FeedbackText": "Most of your essay was talking about how much you love the song. You could have added some facts like the percentage of people who suffer from self-esteem for example. Then you can proceed to relate it to the reason why the song needs to be remade. You should also take note of the arguments you put when trying to prove your point. Many songs nowadays talk about rising above problems and being authentic to yourself. An example of this is Demi Lovato’s song Skyscraper which was released in 2011. You need to have points that people will remember and differentiates you from every other essay. English may not be your first language, but please watch your grammar and punctuation. This may be distracting to some people and can give you a lower score. I suggest you practice writing essays and having it checked by a teacher/coach or even a friend."
  },
  {
    "ScholarID": "115C",
    "FeedbackText": "I like the direction you took with the essay and how you took into account the possibilities of this “creation” you have. You just need to make some things more realistic because things like 15.0 magnitude earthquakes have never even existed. English may not be your strong suit, but try to cover up your mistakes a little more. Use online sites like Grammarly to check your work. The structure of the essay itself needs to be fixed a little because I could not tell if you were talking to someone or someone was talking to you. Use quotation marks to mark a conversation. I need more facts as well. Please research more to help emphasize your point and do not stray too far from the motion."
  },
  {
    "ScholarID": "312X",
    "FeedbackText": "Your grammar and sentence structure is almost flawless. Your essay had a good flow to it, but it lacked certain things. It missed the motion a bit. In the majority of your essay, you did not explicitly say what your reign was like. It was very general and did not have a lot of standout points. Was your reign full of adoration from your citizens due to the reforms you made? Was it one of fear because you were ruthless in having criminals arrested? What amazing achievement happened during your reign? Give more details. It seems more like a thank you note than reminiscing on your reign. A lot of the details you did provide were those of your previous relatives."
  },
  {
    "ScholarID": "312Z",
    "FeedbackText": " Your essay was unique because I did not expect you to have the Last Supper remade. The comparisons in your essay felt very well researched. I just wanted a few more facts in there. Maybe things like how much of the youth do not care for religion nowadays. You also could have related your definition of art to your arguments and points more. The relations you made between religion and society are not very new. You should think about getting important philosophers or researchers’ quotes or findings to bring more validity to the argument. Try not to get so swayed away from the motion so much as to not distract and confuse the readers. English may not be your first language, but your essay is very easy to understand. Practice using more dynamic words and adding figures of speech to the essay for a more interesting read. "
  },
  {
    "ScholarID": "300Y",
    "FeedbackText": " In all sincerity, the paper just seems too brilliant to be true! You open up a new perspective of this motion skilfully. Your essay clotted my ideas into something that is new and you present your infrequent ideas into this masterpiece which; some scholars took years to subdue. Your choices of words fit so well, you were able to elaborate every point incredibly and make it so easy for your judge to read it. So again congratulations! This is how astounded I was by your writing. Please continue writing, Scholar! All the best to your future write-ups!"
  },
  {
    "ScholarID": "318X",
    "FeedbackText": "Props for the originality. Your essay was a nice effort but what i would encourage you to do is a) explain + elongate & b) put more emotion into experiences. Emotion tends to positively provoke the thoughts of the marker and when you elaborate on your things, it doesn't leave it up to them to join the dots; but clearly states loud & clear what you want to convey to them. "
  },
  {
    "ScholarID": "318Y",
    "FeedbackText": "It was a good attempt. I did highly recommend yout to write more and elaborate upon your experiences. A few links back to the curriculum helps too. And try to bring both emotion + a 2nd dimension into your essay. (emotion especially if it's an essay from your own POV)."
  },
  {
    "ScholarID": "309Z",
    "FeedbackText": "Hey Dheekshanya,  I appreciate the path you took with your essay! It is supporting one of the three ‘artistic proofs’ by Aristotle, Pathos. However you could relate your essay back to the curriculum more. I know that this motion isn’t the easiest to relate back but there is always a way, even if you only briefly mention something from the curriculum then that is better than not having anything at all. Good defining at the start but you do not need a whole paragraph on what a reboot is defined as, but rather a main sentence or two. Your use of language was exceptional. Overall a really good essay!"
  },
  {
    "ScholarID": "310X",
    "FeedbackText": "Your essay was very fun to read, and the reasoning was great. However, there is no need to establish/define cacogenics in such a long paragraph. Moreover, when arguing, you should not mention the feasibility of technology as one of your arguments. Instead, spending more words on more unique reasons, such as that in the future, today's geniuses will be obsolete (which was a good point you brought up)."
  },
  {
    "ScholarID": "309X",
    "FeedbackText": "I loved reading your essay! It was very organized and set a clear path for me to follow as I read. The multiple quotes used was relevant, and the statistics well  supported  your argument. Even though the rhetorical questions made your essay interesting, the technique started feeling repetitive after a while. You can use other techniques like metaphors. Overall, great job!"
  },
  {
    "ScholarID": "327Y",
    "FeedbackText": "Thank you for submitting and completing this piece of amazing work! You have a great format layout that makes the readers easy to follow along by opening your points stanza by stanza. Your content appears that you’d studied the curriculum and understood it well. Your way of expressing it is clear and comprehensible. However, you could've added more crucial information behind the piece of art such as the meaning of the lyrics, what the artist went through while writing the song and why it united old and young people. I hope you consider improving your future write-ups. Overall, you did exceedingly well. "
  },
  {
    "ScholarID": "114B",
    "FeedbackText": "It was a pleasure reading your essay! You organized your essay well, using phrases like \"the first reason\", \"the second reason\", and \"to summarize\". One thing you could do to improve is elaborate more on each of your point. Add further examples and analysis. Moreover, it would be great if you could mention what someone that disagrees with you might say. Still, it was a great essay, and keep practicing!"
  },
  {
    "ScholarID": "315Y",
    "FeedbackText": "It was easy to understand. The language, vocabulary and style are very good. You can add more curriculum. You need to work on your grammar."
  },
  {
    "ScholarID": "124A",
    "FeedbackText": "I enjoyed reading your unique approach to the prompt, which was also well supported with your evidence. I do think that your contentions could have been expanded further, however your clarity and consistency with the prompt throughout your piece made for a well constructed argumentative essay. Your use of rhetorical questions also helped me, as a reader, to think more intently about your thoughts without realizing it. Great job!"
  },
  {
    "ScholarID": "327Z",
    "FeedbackText": "Your story was quite creative and interesting. However, I felt that your grammar could be improved. For instance, in one of the sentences, you use \"but\" twice, which should not be happening. Moreover, you could add more details. There are millions of stories out there on queens or kings that are similar to yours. Add something that will make it original to you. For instance, you could mention one achievement that is extremely unique and fantastic. Overall, it was a pleasure reading your essay."
  },
  {
    "ScholarID": "124B",
    "FeedbackText": "Your essay had many valid points, supported with quite a bit of factual evidence (especially for environmental effect). You could improve on your essay by adding a proper thesis to your introduction and using a formal tone. Using first-person pronouns (I, we) can make your essay personal with your reader, but it also shows a lack of an educated tone -use these pronouns sparingly and only when necessary. Your conclusion also makes your tone sound rude and condescending, so remember that you are writing to coaches and do not use the same language in your essay as you do with your friends."
  },
  {
    "ScholarID": "120C",
    "FeedbackText": "Greetings Shriniketh,  I liked how you presented definitions of the main words. However you need to expand on your ideas a little. Your introduction needs to be longer and contain more information, as well as your main argument points. A way of doing this is by remembering MESL (make a point, explain the point, support the point, link the point). I encourage you to work on your explaining, supporting and linking skills. I did like the referencing you made to the curriculum, about kings, corruption, hierarchy etc. Overall you did well for a junior!"
  },
  {
    "ScholarID": "124C",
    "FeedbackText": "As a reader, I can see a lot of effort that you put into writing and researching to get your point of how responsibility is important in everyone's lives. However, you avoided the prompt in the very beginning by expanding on responsibility with too many details-making your answer to the prompt not clear to the reader. Especially during a timed WSC writing event, you would want to spend more time on having a clear thesis, strong body paragraphs, and an insightful conclusion instead of focusing on a word's meaning that could be explained in 1 paragraph instead of 3. For your next WSC essay, you should establish your stance to the prompt towards the beginning and also expand more on your contentions, especially by citing evidence to further strenghten your argument. "
  },
  {
    "ScholarID": "313X",
    "FeedbackText": "You have good language, sentence structure and writing style. Your essay needs to have more clarity and content"
  },
  {
    "ScholarID": "117C",
    "FeedbackText": "It was a pleasure reading your essay! These are a few things you can do to improve. First, make sure that your grammar is correct. For instance, \"CEO? IT WILL VERY IMPORTANT TO HAVE CEOs so, will CEOs have their own successors?\" is grammatically wrong. Moreover, your points focused more on why CEOs are important. Everybody already knows that CEOs are extremely crucial. You should focus more on explaining why it's important that the CEOs get to choose their successors. Still, a great job!"
  },
  {
    "ScholarID": "112A",
    "FeedbackText": "You did well on your first and second paragraph, it was amazing how you used significant references from the curriculum, however your third paragraph slightly lacked depth. you raised many questions about the essay motion in your third paragraph, so try to explain those better by adressing each of those questions with anecdotes, references etc. also try to vary your choice of words rather than just using trite words such as \"good\" \"very\" etc."
  },
  {
    "ScholarID": "112C",
    "FeedbackText": "Your essay was very informative, and showed your knowledge of the curriculum adequately. However, there were also parts where it sounded like a reesearch essay, and that is where i slightly lost interest. If you want your essay to be truly hooking, i suggest that you also use annecdotes and connect back to our lives when talking about the motion. \"do we wear fast fahion?\" \"do i wear fast fashion?\" etc. and tryy to break the fourth wall between the reader and you. Also, when talking about specific subject matters, try to out in a little bit of signposting on the topic. Overall very well articulated, thank you!"
  },
  {
    "ScholarID": "320X",
    "FeedbackText": "It was decent effort. What was missing was clarity in terms of the prompt. I did highly recommend you to attack the prompt instead of trying to softline it, as your current method can leave the essay marker in a connect-the-dots & what if scenario."
  },
  {
    "ScholarID": "117A",
    "FeedbackText": "You essay is clear, simple and has good structure. You can include vocabulary and more examples. You need to be specific on your points and elaborate more on them."
  },
  {
    "ScholarID": "112B",
    "FeedbackText": "Good elaboration, sentence structure and content. You can use more vocabulary."
  },
  {
    "ScholarID": "318Z",
    "FeedbackText": "Elaboration would be my main advice. Your arguments were nice, but they didn't touch-base with the prompt directly; which can leave the essay-marker to form their own interpretation by connecting the dots int their own way, which might overlook smth you were trying to convey."
  },
  {
    "ScholarID": "311X",
    "FeedbackText": "Hello Yap.  I really liked your decision about going down the creative path for this essay as it really suits the motion, your story worked cohesively with the motion. However you did get slightly off-track from the motion on your second page. I would suggest trying to link back to the motion and relating your story / essay to the WSC curriculum, as that scores you higher. Your use of language was above adequate and overall I really enjoyed it, just focus on your relativity next time and it’ll be even better!  Marked by Emma101A#8919 on discord "
  },
  {
    "ScholarID": "320Z",
    "FeedbackText": "It was a nice effort but you do need to focus on the topic more. Further improvements could be elaboration of thoughts + linking back to curriculum. (The topic here specifically asked for that, so essay-markers are bound to mark you badly if you don't mention the curriculum once in a curriculum-linked prompt)."
  },
  {
    "ScholarID": "312Y",
    "FeedbackText": "G’day Bryan,  I liked how your essay was highly informative and defined everything before continuing into the main clash. However you didn’t really conclude your opinion on the motion. You also didn’t go into any major depth about why the diderot effect should be banned. Can it even be banned or is it more of a psychological effect rather than a promotion technique? Overall your essay was adequate, I would suggest working on concluding information and going into greater depth.   If you want to talk more about it then don’t be afraid to message me on discord Emma101A#8919"
  },
  {
    "ScholarID": "310Z",
    "FeedbackText": "Hi Wei Zhi Jie,  I liked how you took the creative approach to the history motion, however there are quite a few skills which you could improve. Factual information may not seem important in creative texts but it is a vital piece of information for the storyline. There were a few false facts throughout your text about how the hierarchy works etc. Your use of complex language here and there was adequate for the text. Always try to relate back to the WSC curriculum as that will score you higher."
  },
  {
    "ScholarID": "110Z",
    "FeedbackText": "The scholar has a variety of ideas and decisiveness. The scholar has to work on his writing style and has to be specific. "
  },
  {
    "ScholarID": "120B",
    "FeedbackText": "Your essay was too short and lacked clear structure (beginning, middle, end). You should elaborate more on why you would save Kobe Bryant and the people in the helicopter - do you have a personal attachment to him? Has he indirectly helped you somehow? Your grammar and spelling was pretty accurate but there were some minor errors, so ensure that you’ve rechecked that. The methodology of how you were going to delay the helicopter ride was rather vague, so I suggest you explain more on that. You should try to use more varied vocabulary to make the essay more engaging and interesting. Overall, you answered the prompt, but you need to elaborate and lengthen your essay."
  },
  {
    "ScholarID": "122A",
    "FeedbackText": "Your essay had a clear beginning, middle, and ending. However, I didn’t quite understand what it was that you were trying to edit, as you only wrote that it would “help people to manage the time and solve their question”. What does this mean? Make sure you’ve elaborated upon this so the reader can better understand your stance. You could also talk about why you wanted this machine. Some points you stated weren’t clearly linked back, such as how the machine could help solve the “overweight problem”. Your conclusion was also quite confusing. You also had multiple grammar and syntax errors, so I suggest you recheck your essay before submission for these errors to make the reader understand your work better. Length-wise, your essay is quite ideal. All in all, I’d suggest that you could link your points in a more cohesive manner and recheck your essay for errors."
  },
  {
    "ScholarID": "300X",
    "FeedbackText": "Your essay had a clear beginning, middle, and ending. I liked how you gave background context on Diderot’s effect, which would help a reader who didn’t understand what a Diderot effect is. There were minimal errors, and your vocabulary was quite varied. The rhetorical questions you added to the piece made it more engaging, so good job! However, I felt like you jumped from one point to another without a clear link between each other. Since you had quite a lot of different points, I felt like there was an information overload. You went a little over the word limit, so I would suggest cutting down some points. In the actual World Scholar’s Cup competition, you won’t rank higher just because you wrote more facts than someone. Sometimes, simple essays that clearly explain ONE point does the trick. Overall, I’d commend your efforts on this essay!"
  },
  {
    "ScholarID": "122B",
    "FeedbackText": "Your essay was of good length, and you brought up a couple of interesting points. However, i feel like you could have explained some of these points in greater depth as although you had numerous points, they were rushed towards the end. instead of bringing up multiple points, focus on one or two and develop them thouroughly!!"
  },
  {
    "ScholarID": "305Z",
    "FeedbackText": "Thank you for your participation in couch camp! i believe that the signposting in the start of your essay was rather good, i understood what you were going to say in your essay, and helped me understand. You should try to use more referednces and anecdotes to link back to your stance, so that your essay becomes stronger."
  },
  {
    "ScholarID": "311Y",
    "FeedbackText": "Greetings! Your cc2 essay was certainly something interesting to read as a marker, however, there were some issues that prevented you from getting you an extrememly high score, but an adequate score. You didnt make any points towards the motion, and the points that you made didnt have enough evidence to back it up sufficiently. Thank you so much for submitting a CC2 essay!!"
  },
  {
    "ScholarID": "328X",
    "FeedbackText": "Thanks for submitting your essay! Your essay had good points, but you should try to explain your second and third point in more depth because i felt that those were slightly rushed. Thank you so much!"
  },
  {
    "ScholarID": "121C",
    "FeedbackText": "Thank you for writing an essay for cc2! i saw that you used the example of COVID in your essay and i thought that was well linked back to your normal life. however, i feel like you could have worked more on developing your points and making them clear, as i did not understand where exactly your points were. Thank you again for participating in cc2, have a good day."
  }
]
